# Homebrew Taps
tap "heroku/brew"
tap "homebrew/bundle" # brew bundle
tap "homebrew/services" # brew services

# https://formulae.brew.sh/formula/ インストールしたいパッケージを検索
# brew

# install depends on which needs
# brew "asdf"
# brew "anyenv"

# it maybe unnecessary
# brew 'peco'

brew 'git'
brew 'zstd'
brew 'lazygit'
brew 'openssl'
brew 'neovim'
brew 'starship'
brew 'watchman'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# to use psych for rbenv
brew 'libyaml'

# for telescope/lazyvim
brew 'fd'
brew 'luarocks'
brew 'ripgrep'

# for ruby-lsp in LazyVim
brew "mysql"

# private needs
# brew "golang-migrate"
# brew "heroku/brew/heroku"
# brew "postgresql@14"

# https://formulae.brew.sh/cask/ でインストールしたいアプリを検索
# dev
# cask "dia" # commented out until brew can install dia
cask 'firefox'
cask "google-chrome"
cask "docker-desktop"
cask "font-fira-code-nerd-font"
cask "iterm2"
cask "wezterm@nightly"
cask "visual-studio-code"
cask "karabiner-elements"
cask "raycast"
cask "rectangle"
cask "sequel-ace"
cask "postman"
cask "slack"
cask "zoom"
cask "meetingbar"

# private needs
# cask "notion"
# cask "spotify"
# cask "mattermost"
# cask "gather"
# cask "raspberry-pi-imager"
# cask "discord"
# cask "1password"
# cask "xcodes-app"

# VS Code Extensions
# vscode "alexcvzz.vscode-sqlite"
# vscode "asvetliakov.vscode-neovim"
# vscode "biomejs.biome"
# vscode "dbaeumer.vscode-eslint"
# vscode "docker.docker"
# vscode "donjayamanne.githistory"
# vscode "eamodio.gitlens"
# vscode "esbenp.prettier-vscode"
# vscode "github.copilot"
# vscode "github.copilot-chat"
# vscode "gruntfuggly.todo-tree"
# vscode "hediet.vscode-drawio"
# vscode "humao.rest-client"
# vscode "mechatroner.rainbow-csv"
# vscode "ms-azuretools.vscode-docker"
# vscode "ms-python.black-formatter"
# vscode "ms-python.flake8"
# vscode "ms-python.python"
# vscode "ms-vscode-remote.remote-containers"
# vscode "ms-vscode-remote.remote-ssh"
# vscode "ms-vscode-remote.remote-ssh-edit"
# vscode "ms-vscode.remote-explorer"
# vscode "pkief.material-icon-theme"
# vscode "rubbersheep.gi"
# vscode "streetsidesoftware.code-spell-checker"
# vscode "tamasfe.even-better-toml"
# vscode "usernamehw.errorlens"
# vscode "yzhang.markdown-all-in-one"
