# https://formulae.brew.sh/formula/ インストールしたいパッケージを検索
# brew
brew 'git'
brew 'zsh'
brew 'asdf'
brew 'peco'
brew 'neovim'
brew 'lazygit'
brew 'openssl'
brew 'starship'
brew 'fzf'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# for telescope in lazyvim
brew 'fd'
brew 'ripgrep'

# for expo
brew 'watchman'
# https://formulae.brew.sh/cask/ でインストールしたいアプリを検索
# dev
cask 'visual-studio-code'
cask 'sequel-ace'
cask 'iterm2'
cask 'wezterm@nightly'
cask 'xcodes'
cask 'rectangle'
cask 'docker'
cask 'postman'
cask 'notion'
cask 'mattermost'

# terminal
cask 'font-fira-code-nerd-font'

# keybords
cask 'karabiner-elements'

# browser
cask 'google-chrome'
cask 'firefox'
cask 'arc'

# application
cask '1password'
cask 'slack'
cask 'zoom'
cask 'spotify'
cask 'discord'
cask 'meetingbar'
cask 'gather'
cask 'raspberry-pi-imager'
cask 'logi-options-plus'
cask 'raycast'
