# https://formulae.brew.sh/formula/ インストールしたいパッケージを検索
# brew
brew 'git'
brew 'zsh'
brew 'anyenv'
brew 'peco'
brew 'neovim'
brew 'openssl'
brew 'starship'

# https://formulae.brew.sh/cask/ でインストールしたいアプリを検索
# dev
cask 'visual-studio-code'
cask 'sequel-ace'
cask 'iterm2'
cask 'wezterm@nightly'
cask 'xcodes'
cask 'rectangle'
cask 'docker'
cask 'postman'
cask 'skitch'
cask 'notion'
cask 'warp'
cask 'arc'

# keybords
cask 'karabiner-elements'

# browser
cask 'google-chrome'
cask 'firefox'

# application
cask '1password'
cask 'slack'
cask 'zoom'
cask 'spotify'
cask 'discord'
cask 'meetingbar'
cask 'gather'
cask 'raspberry-pi-imager'
cask 'logi-options-plus'
