cask "1password"
cask "arc"
cask "discord"
cask "docker-desktop"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "gather"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "logi-options+"
cask "mattermost"
cask "meetingbar"
cask "notion"
cask "postman"
cask "raspberry-pi-imager"
cask "raycast"
cask "rectangle"
cask "sequel-ace"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "warp"
cask "wezterm@nightly"
cask "xcodes-app"
cask "zoom"
