brew "openssl@3"
brew "asdf"
brew "zstd"
brew "fd"
brew "git"
brew "golang-migrate"
brew "lazygit"
brew "mysql", restart_service: :changed
brew "neovim"
brew "peco"
brew "postgresql@14"
brew "ripgrep"
brew "starship"
brew "watchman"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "heroku/brew/heroku"
